Workspace/OpenFOAM-v1812-AD/tutorials/compressible/rhoPimpleFoam/laminar/sineWaveDamping/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1000
(
1.000000000000008e-06
9.999999999999786e-07
1.000000000000008e-06
1.000000000000038e-06
9.999999999999489e-07
1.000000000000008e-06
1.000000000000068e-06
9.999999999999489e-07
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.0004;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.0004;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
